Тест_ЗУП_31_КОРП/src/Catalogs/ВидыАттестацийСотрудников/ВидыАттестацийСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыАттестацийСотрудников</name>
  <predefined>
    <items>
      <name>АттестацияГосударственныхСлужащих</name>
      <description>Аттестация государственных служащих</description>
    </items>
    <items>
      <name>ПодтверждениеКвалификацииМедицинскихРаботников</name>
      <description>Подтверждение квалификации медицинских работников</description>
    </items>
  </predefined>
  <attributes>
    <name>АттестовыватьВсеДолжностиСпециальности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозрастДоКоторогоСотрудникНеПодлежитАттестации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозрастПослеКоторогоСотрудникНеПодлежитАттестации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОграничениеПоМаксимальномуВозрасту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОграничениеПоМинимальномуВозрасту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОграничениеПоМинимальномуСрокуРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовМинимальногоСрокаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьМинимальногоСрокаРаботы</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАттестации</name>
    <type>
      <types>EnumRef.ТипыАттестацииСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВнешняяАттестация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсключаемыеДолжности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсключаемыеСпециальности</name>
    <attributes>
      <name>Специальность</name>
      <type>
        <types>CatalogRef.КлассификаторСпециальностейПоОбразованию</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Enums/ТипыАттестацииСотрудников/ТипыАттестацииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыАттестацииСотрудников</name>
  <enumValues>
    <name>ПодтверждениеСоответствияДолжности</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеКвалификацииПоСпециальности</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/ВидыАттестацийСотрудников/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ТипАттестации = Перечисления.ТипыАттестацииСотрудников.ПодтверждениеСоответствияДолжности Тогда
		Если ЭтоВнешняяАттестация Тогда
			ЭтоВнешняяАттестация = Ложь;
		КонецЕсли;
		Если ИсключаемыеСпециальности.Количество() > 0 Тогда
			ИсключаемыеСпециальности.Очистить();
		КонецЕсли;
	ИначеЕсли ТипАттестации = Перечисления.ТипыАттестацииСотрудников.ПодтверждениеКвалификацииПоСпециальности Тогда
		Если ИсключаемыеДолжности.Количество() > 0 Тогда
			ИсключаемыеДолжности.Очистить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	АттестацииСотрудников.УстановитьНеобходимостьВыбораВидаАттестации();
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
